In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from math import sqrt
from scipy import stats

from pydataset import data

from env import host, user, password
from wrangle import wrangle_telco

In [ ]:
def get_db_url(username, hostname, password, db_name):
    return f'mysql+pymysql://{username}:{password}@{hostname}/{db_name}'

In [ ]:
query = '''
SELECT customer_id, monthly_charges, tenure, total_charges
FROM customers
WHERE contract_type_id = 3;
'''

In [ ]:
url = get_db_url(user,host,password,'telco_churn')

In [ ]:
telco = pd.read_sql(query,url)

In [ ]:
telco.head()

Acquire customer_id, monthly_charges, tenure, and total_charges from telco_churn database for all customers with a 2 year contract.

In [ ]:
telco.info()

In [ ]:
telco['total_charges'] = telco['total_charges'].replace(r'^\s*$', '0', regex=True)

In [ ]:
telco['total_charges'] = telco['total_charges'].astype(float)

In [ ]:
telco.dropna(inplace=True)

In [ ]:
telco.info()

In [9]:
wrangle_telco()

     customer_id  monthly_charges  tenure  total_charges
0     0013-SMEOE           109.70      71        7904.25
1     0014-BMAQU            84.65      63        5377.80
2     0016-QLJIS            90.45      65        5957.90
3     0017-DINOC            45.20      54        2460.55
4     0017-IUDMW           116.80      72        8456.75
...          ...              ...     ...            ...
1690  9964-WBQDJ            24.40      71        1725.40
1691  9972-EWRJS            19.25      67        1372.90
1692  9975-GPKZU            19.75      46         856.50
1693  9993-LHIEB            67.85      67        4627.65
1694  9995-HOTOH            59.00      63        3707.60

[1695 rows x 4 columns]